# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

1st attempt (failed):
- load the previously cleaned, locally saved file1
- load from url the files file2,file3
- concatenate the 3 files to a single df
- clean the df with the main_function from the script made for the previous lab 2.2.
- cleaning failed.

2nd attempt(failed):
- let's clean the files 1-by-1, with the main_function from the script from the 2.2 lab.
- file1 is already previously cleaned.
- file 2, successfully cleaned.
- fail to clean the file3(df3).

3rd attempt(success):
- cleaned the file3(df3) by using specific functions from the script.
- concatenated the 3 clean datasets.

In [20]:
%load_ext autoreload
%autoreload 2

import pandas as pd
import script_2_2_lab_dw_data_cleaning_and_formatting as script

df1 = pd.read_csv("file1_cleaned.csv")
display(df1.head())

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [49]:
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv"
df2 = script.main_function(url)

Sum of null values before cleaning: 4
Sum of null values after cleaning: 0
Sum of duplicated values before dropping: 0
Sum of duplicated values after dropping: 0

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,total_claim_amount,policy_type,vehicle_class
0,GS98873,Arizona,F,Bachelor,323912.47,16061,88,0,633.6,Personal Auto,Four-Door Car
1,CW49887,California,F,Master,462680.11,79487,114,0,547.2,Special Auto,SUV
2,MY31220,California,F,College,899704.02,54230,112,0,537.6,Personal Auto,Two-Door Car
3,UH35128,Oregon,F,College,2580706.30,71210,214,1,1027.2,Personal Auto,Luxury
4,WH52799,Arizona,F,College,380812.21,94903,94,0,451.2,Corporate Auto,Two-Door Car

In [50]:
url = "https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv"
df3 = script.cleaning_column_names(url)

df3["vehicle_class"] = df3["vehicle_class"].apply(lambda x: "Luxury" if x in ["Sports Car", "Luxury SUV", "Luxury Car"] else x)

df3 = script.manage_null_values(df3)
df3 = script.manage_duplicated_values(df3)

display(df3.head())

Sum of null values before cleaning: 0
Sum of null values after cleaning: 0
Sum of duplicated values before dropping: 0
Sum of duplicated values after dropping: 0

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV

In [44]:
df4 = pd.concat([df1, df2, df3])
df4

,customer,state,customer_lifetime_value,education,gender,income,monthly_premium_auto,number_of_open_complaints,policy_type,total_claim_amount,vehicle_class
0,SA25987,Washington,3479.137523,High School or Below,M,0,104,0,Personal Auto,499.200000,Two-Door Car
1,TB86706,Arizona,2502.637401,Master,M,0,66,0,Personal Auto,3.468912,Two-Door Car
2,ZL73902,Nevada,3265.156348,Bachelor,F,25820,82,0,Personal Auto,393.600000,Four-Door Car
3,KX23516,California,4455.843406,High School or Below,F,0,121,0,Personal Auto,699.615192,SUV
4,FN77294,California,7704.958480,High School or Below,M,30366,101,2,Personal Auto,484.800000,SUV
...,...,...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,23405.987980,Bachelor,M,71941,73,0,Personal Auto,198.234764,Four-Door Car
7066,PK87824,California,3096.511217,College,F,21604,79,0,Corporate Auto,379.200000,Four-Door Car
7067,TD14365,California,8163.890428,Bachelor,M,0,85,3,Corporate Auto,790.784983,Four-Door Car
7068,UP19263,California,7524.442436,College,M,21941,96,0,Personal Auto,691.200000,Four-Door Car
7069,Y167826,California,2611.836866,College,M,0,77,0,Corporate Auto,369.600000,Two-Door Car

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [109]:
# It's unclear which column shows the revenue, so I took the monthly_premium_auto.
# The highest monthly_premium_auto comes from the Agent sales channel, and least from Web.

df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv")
df.pivot_table(index="sales_channel", values="monthly_premium_auto", aggfunc="sum").round(2)

               monthly_premium_auto
sales_channel
Agent                        386335
Branch                       280953
Call Center                  197970
Web                          151511

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [90]:
# The highest mean customer_lifetime_value is for female customer with high school or below.
# The lowest one is for female customer with doctor's degree.
# There is no seeming correlation between the levels of customer_lifetime_value and education.

df.pivot_table(index="gender", columns="education", values="customer_lifetime_value", aggfunc="mean").round(2)

education  Bachelor  College   Doctor  High School or Below   Master
gender
F           7874.27  7748.82  7328.51               8675.22  8157.05
M           7703.60  8052.46  7415.33               8149.69  8168.83

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [119]:
pivot_wide = df.pivot_table(index="policy_type", columns="month", values="number_of_open_complaints", aggfunc="sum").round(2)
pivot_wide.reset_index().melt(id_vars=["policy_type"], var_name="month", value_name="number_of_open_complaints")

      policy_type month  number_of_open_complaints
0  Corporate Auto     1                     443.43
1   Personal Auto     1                    1727.61
2    Special Auto     1                      87.07
3  Corporate Auto     2                     385.21
4   Personal Auto     2                    1453.68
5    Special Auto     2                      95.23